In [2]:
import pandas as pd
df= pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
years=[90,80,70,60]
df=pd.DataFrame(years,columns=['years'])
print(df)

   years
0     90
1     80
2     70
3     60

In [4]:
data={'name':['tom','cook','nick'],
        'age':[20,23,53]}
df= pd.DataFrame(data)
print(df)

   name  age
0   tom   20
1  cook   23
2  nick   53

In [7]:
import numpy as np  #for NaN values
data={'name':['tom','cook','nick','jack','krish'],'ID_no':[1,3,4,np.nan,5],
        'age':[20,15,13,12,10]}

df= pd.DataFrame(data)
print(df)

    name  ID_no  age
0    tom    1.0   20
1   cook    3.0   15
2   nick    4.0   13
3   jack    NaN   12
4  krish    5.0   10

In [8]:
df.corr() #correlation(how strongly or weakly they are corelated with each other )

          ID_no       age
ID_no  1.000000 -0.998381
age   -0.998381  1.000000

here is negative correlation among the id and age

In [18]:
data={'name':['harry','lucas','nike','jack','mike'],'ID_no':[1,3,4,np.nan,5],
        'age':[20,23,53,21,26],'weight':[45,42,23,35,89]}
df1=pd.DataFrame(data)
df1

    name  ID_no  age  weight
0  harry    1.0   20      45
1  lucas    3.0   23      42
2   nike    4.0   53      23
3   jack    NaN   21      35
4   mike    5.0   26      89

In [19]:
df1.corr()

           ID_no       age    weight
ID_no   1.000000  0.443046  0.428164
age     0.443046  1.000000 -0.402698
weight  0.428164 -0.402698  1.000000

append datframe

In [17]:
df.append(df1)

C:\Users\patil\AppData\Local\Temp\ipykernel_19512\202388049.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df1)

    name  ID_no  age  weight
0    tom    1.0   20      45
1   cook    3.0   23      42
2   nick    4.0   53      23
3   jack    NaN   21      35
4  krish    5.0   26      89
0    tom    1.0   20      45
1   cook    3.0   23      42
2   nick    4.0   53      23
3   jack    NaN   21      35
4  krish    5.0   26      89

In [27]:
df.append(df1,ignore_index=True)

C:\Users\patil\AppData\Local\Temp\ipykernel_19512\2746747452.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df1,ignore_index=True)

    name  ID_no  age  weight
0    tom    1.0   20      45
1   cook    3.0   23      42
2   nick    4.0   53      23
3   jack    NaN   21      35
4  krish    5.0   26      89
5  harry    1.0   20      45
6  lucas    3.0   23      42
7   nike    4.0   53      23
8   jack    NaN   21      35
9   mike    5.0   26      89

In [24]:
df.dropna(axis=1)

    name  age  weight
0    tom   20      45
1   cook   23      42
2   nick   53      23
3   jack   21      35
4  krish   26      89

In [7]:
df.head(2)

   name  ID_no  age
0   tom    1.0   20
1  cook    3.0   23

In [8]:
df.groupby("age").mean()

     ID_no
age
20     1.0
21     NaN
23     3.0
26     5.0
53     4.0

In [10]:
df.groupby("age").agg(["mean","sum","median"])

C:\Users\patil\AppData\Local\Temp\ipykernel_6900\1412641498.py:1: FutureWarning: ['name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby("age").agg(["mean","sum","median"])

    ID_no
     mean  sum median
age
20    1.0  1.0    1.0
21    NaN  0.0    NaN
23    3.0  3.0    3.0
26    5.0  5.0    5.0
53    4.0  4.0    4.0

In [43]:
w=5; x=4; y=8; z=2
result=x+y*y/2
print(result)

36.0

In [52]:
a
=int(input("enter the number of male in class"))
b=int(input("enter the number of female in class"))
p=a/20*100
print(" the percentageof male  is",p)
p=b/20*100
print(" the percentageof female  is",p)
#percentage of female=b/12*100
#print(percent of b)

enter the number of male in class4
enter the number of female in class4
 the percentageof male  is 50.0
 the percentageof female  is 33.33333333333333

In [44]:
x=6;y=2
print(x**y)

36

In [56]:
a=int(input("enter the marks of first subject"))
b=int(input("enter the marks of second subject"))
c=int(input("enter the marks of third subject"))
p=a+b+c/90*100 #p=percentage
print(p)

enter the marks of first subject30
enter the marks of second subject30
enter the marks of third subject30
93.33333333333333